**Missing values Analysis**

- MVA is very imp in Data Analysis

- It is very quiet natural data set has missing values

- There are so many techniques are there for handling missing value 

    - Mean
    
    - Median
    
    - Mode
    
    - bfill
    
    - ffill
    
    - pad
    
    - random values
    
    - You can compare column values and you can compute
    
    - KNN Imputer

In [1]:
import pandas as pd

import numpy as np

In [14]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.nan],
      "Ages":[30,31,np.nan,33],
      "City":[np.nan,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [10]:
d1.isnull()

   Namaes   Ages   City
0   False  False  False
1   False  False  False
2   False   True  False
3    True  False  False

In [16]:
d1.isnull().sum()

Namaes    1
Ages      1
City      1
dtype: int64

In [55]:
dict1={'Names':['Ramesh','Suresh','Sathish','Null'],
'Ages':[30,31,'Null',32],
'City':['Null','Hyd','Pune','Chennai']}
d2=pd.DataFrame(dict1)
d2

     Names  Ages     City
0   Ramesh    30     Null
1   Suresh    31      Hyd
2  Sathish  Null     Pune
3     Null    32  Chennai

In [54]:
d2.isnull() # Null is not considered as an empty value

   Names   Ages   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [56]:
dict1={'Names':['Ramesh','Suresh','Sathish',None],
'Ages':[30,31,None,32],
'City':[None,'Hyd','Pune','Chennai']}
d3=pd.DataFrame(dict1)
d3

     Names  Ages     City
0   Ramesh  30.0     None
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3     None  32.0  Chennai

In [57]:
d3.isnull() # None is taken as empty value but Null is not taken

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

$Method1$

**Random Fill**

In [59]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.nan],
      "Ages":[30,31,np.nan,33],
      "City":[np.nan,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [60]:
d1.fillna(40,inplace=True)

In [61]:
d1 # This Random fill will fill the value in all missing positions

   Namaes  Ages   City
0  Ramesh  30.0     40
1  Suresh  31.0  Vizag
2  Satish  40.0    Goa
3      40  33.0   Pune

$Method2$

**Fill the random values based on column**

In [63]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [64]:
d1['Ages'].fillna(40,inplace=True)

In [65]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  40.0    Goa
3     NaN  33.0   Pune

$Method3$

- **Mean**
- **Median**
- **Mode**

In [ ]:
Median doesnot afftect by outliers

Mean affected by outliers

If you have data is there,

    - First check with outlier, boxplot
    
    - You can check with created outlier function
    
    - If you feel there are outliers replace with Median

In [27]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [30]:
age_Mean=d1['Ages'].mean()
age_Mean
d1['Ages'].fillna(age_Mean,inplace=True)

In [31]:
d1

   Namaes       Ages   City
0  Ramesh  30.000000    NaN
1  Suresh  31.000000  Vizag
2  Satish  31.333333    Goa
3     NaN  33.000000   Pune

In [32]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [ ]:
age_Median=d1['Ages'].median()
age_Median
d1['Ages'].fillna(age_Median,inplace=True)

In [25]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3     NaN  33.0   Pune

$Method 4$

- **pad**
- **bfill**
- **ffill**
- **backfill**

In [74]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [43]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish   NaN    Goa
3     NaN  33.0   Pune

In [36]:
d1.fillna(method='pad') #pad method fills the values present in the above column default axis =0(column)

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3  Satish  33.0   Pune

In [70]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [71]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish   NaN    Goa
3     NaN  33.0   Pune

In [41]:
d1.fillna(method='pad',axis=0)

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3  Satish  33.0   Pune

In [44]:
d1.fillna(method='pad',axis=1) axis=1 is row

   Namaes    Ages   City
0  Ramesh    30.0   30.0
1  Suresh    31.0  Vizag
2  Satish  Satish    Goa
3     NaN    33.0   Pune

In [47]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [48]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish   NaN    Goa
3     NaN  33.0   Pune

In [49]:
d1.fillna(method='bfill')

   Namaes  Ages   City
0  Ramesh  30.0  Vizag
1  Suresh  31.0  Vizag
2  Satish  33.0    Goa
3     NaN  33.0   Pune

In [50]:
dict1={"Namaes":["Ramesh","Suresh","Satish",np.NaN],
      "Ages":[30,31,np.NaN,33],
      "City":[np.NaN,"Vizag","Goa","Pune"]}
d1=pd.DataFrame(dict1)

In [51]:
d1

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish   NaN    Goa
3     NaN  33.0   Pune

In [52]:
d1.fillna(method="ffill")

   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3  Satish  33.0   Pune

In [72]:
print('============pad=================')
print(d1.fillna(method='pad'))
print('============bfill=================')
print(d1.fillna(method='bfill'))
print('============ffill=================')
print(d1.fillna(method='ffill'))
print('============backfill=================')
print(d1.fillna(method='backfill'))

============pad=================
   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3  Satish  33.0   Pune
============bfill=================
   Namaes  Ages   City
0  Ramesh  30.0  Vizag
1  Suresh  31.0  Vizag
2  Satish  33.0    Goa
3     NaN  33.0   Pune
============ffill=================
   Namaes  Ages   City
0  Ramesh  30.0    NaN
1  Suresh  31.0  Vizag
2  Satish  31.0    Goa
3  Satish  33.0   Pune
============backfill=================
   Namaes  Ages   City
0  Ramesh  30.0  Vizag
1  Suresh  31.0  Vizag
2  Satish  33.0    Goa
3     NaN  33.0   Pune

**pad and ffill are same**

**bfill and backfill are same**

**Categorical columns**

- Categorical column mainly does not have any meaning in dataframes

- If it is some text or sentence you can find the meaning of the sentence

- For example Names column is there, Review column is there

- Becaues of only Name it self you can't judge the output

- But a Review can impact the output

- Generally if any naive names kind of columns we can fill in any way

- But if some columns impacting output, Yes we need to fill those columns with an idea about how that column is related with other coulumns

$Method 5$

**KNN Imputers**

- K nearest Imputers

- It is one of the ML model to find the nearest solution based distance metric

- Instead of taking all the values of mean 

- why cant we take neighbours mean of the observation

- Here first will choose neighbours

- It will calculate mean of those neighbours and fill with that value

**Package name: Sklean.imputer**

**Method name: KnnImputer**
You need to explore this
Test with Numerical column
Test with categorical column+ Numerical

In [81]:
dict2={"Namaes":["Ramesh","Suresh","Satish",np.NaN,"Latha","Ram","Tanmay"],
      "Ages":[30,31,35,np.NaN,33,38,40],
      "City":[np.NaN,"Vizag","Goa","Pune","Hyd","Varanasi","Vja"]}
d5=pd.DataFrame(dict2)

In [76]:
d5

   Namaes  Ages      City
0  Ramesh  30.0       NaN
1  Suresh  31.0     Vizag
2  Satish  35.0       Goa
3     NaN   NaN      Pune
4   Latha  33.0       Hyd
5     Ram  38.0  Varanasi
6  Tanmay  40.0       Vja

In [82]:
d5['Ages']

0    30.0
1    31.0
2    35.0
3     NaN
4    33.0
5    38.0
6    40.0
Name: Ages, dtype: float64

In [88]:
from sklearn.impute import KNNImputer

impute_knn= KNNImputer(missing_values=np.NaN,n_neighbors=2)
impute_knn.fit_transform(d5[['Ages']])

array([[30. ],
       [31. ],
       [35. ],
       [34.5],
       [33. ],
       [38. ],
       [40. ]])

In [87]:
(35+33)/2

34.0